{
  "posts": [
    {
      "archived": 1,
      "archived_on": 1590684727,
      "bumplimit": 0,
      "closed": 1,
      "com": "Storytime /fit/<br><br>Because I&#039;m a massive weeaboo faggot, I&#039;ve been writing the story of what would happen if a /fit/izen was reincarnated in a world of magic and shit. This is the first chapter. Enjoy.<br><br>Chapter 1: Rebirth<br><br>Dark raindrops fell on the cold asphalt, illuminated by the headlights of the passing cars.<br><br>A lone, hulking figure, carrying a duffelbag, walked slowly through the rain, shoulder hunched to shelter against the cold of the night. He’d just finished his daily workout at the 24-hour gym he was registered at, lifting alone in the middle of the night as usual. He liked the loneliness of an empty gym.<br><br>As the clock had gone past midnight, it was now his 30th birthday. According to several legends on the internet, he was now officially a Wizard, having never felt even the embrace of a woman apart from his mother in all of his life. Despite having the body of a marble statue carved to illustrate the perfect specimen, his lack of ambition in life, and perhaps lack of affection from anyone, had led his personality to become that of a hermit.<br><br>Perhaps it was the darkness of the night and the patter of rain, or perhaps it was him being lost in a world inside his head, that made him not notice the dairy truck that was driving at full speed towards him as he crossed the road to his apartment building. The result was the same, however, and the last thing he would see in this world was a rapidly approaching set of lights.<br><br>- <br><br>When he came to, he was in a sauna. Apart from a small towel draped across his nethers, he was naked, sweat already glistening off his muscles. Confusion struck, and his mind had to grasp for a few seconds with the new reality before he could properly focus. His eyes scanned the damp room and found a figure sitting at the other end of the sauna. Dark, tattooed skin stretched over a body of lean muscle, spiky dark hair on his head, and a sly smile on his face. The figure grinned.<br><br>“Looks like ya finally made it, brah.”",
      "ext": ".jpg",
      "filename": "yes I do",
      "fsize": 76862,
      "h": 820,
      "imagelimit": 0,
      "images": 22,
      "md5": "Sn9qvFevKPsfuwcIKOw5sw==",
      "name": "Anonymous",
      "no": 55761078,
      "now": "05/27/20(Wed)16:32:43",
      "replies": 96,
      "resto": 0,
      "semantic_url": "fitizen-isekai",
      "sub": "/fit/izen Isekai",
      "tim": 1590611563049,
      "time": 1590611563,
      "tn_h": 250,
      "tn_w": 196,
      "w": 643
    },
    {
      "com": "<a href=\"#p55761078\" class=\"quotelink\">&gt;&gt;55761078</a><br>“...Zyzz?” the man asked, now even more confused.<br><br>“That’s right, brah. Can’t believe ya carked it before shaggin’ a sheila, but here we are.”<br><br>“I’m dead? And this is the afterlife?”<br><br>“Yer half wrong there, breh. Yer 6 feet unda, but this ain’t the afterlife. Ya did it, ya sad cunt. Ya became a Wizard. And as a reward, ya get the chance for a do-over.”<br><br>Zyzz stood up, sweat falling off his body. He staggered for a moment before regaining composure.<br><br>“Jaysus Chroist, even when I’m dead the sauna’s still trying to get me. Anyway brah, I’m gonna send ya to a world of magic and swords, so ya betta do ya best this time around to finally get laid and become a mad cunt.”<br><br>“Wait, what? Magic and swords and… what do you mean!?”<br><br>“It’s magic, brah. I ain’t gotta explain shit.”<br><br>And with that, Zyzz flexed his pecs, struck a pose, and winked at the man, who vanished into steamy mist.<br><br>-<br><br>A river curved its way through a valley of grassy hills and oak trees. Sparse farms and farmland were scattered here and there, and in the middle of the valley was a small hamlet built around an old stone bridge crossing the river. Sun was basking from a nearly cloudless sky, and birdsong was carried by the wind to the ears of the farmers toiling with sowing the fields. Spring was in the air.<br><br>At a small wooden hut near the edge of a forest, not too far from the small village, a young boy was chopping wood energetically. He was thin, of average height, with a fair complexion, light brown hair, and deep green eyes.<br><br>“Phew,” he exclaimed, putting down the hatchet. He walked over to the nearby well and procured a bucket of water that he drank from vigorously, making sure to spill at least half all over himself in the process. Finishing drinking, he spotted an old, gray-haired woman walking up the road towards the hut.",
      "name": "Anonymous",
      "no": 55761094,
      "now": "05/27/20(Wed)16:34:06",
      "resto": 55761078,
      "time": 1590611646
    },
    {
      "com": "<a href=\"#p55761078\" class=\"quotelink\">&gt;&gt;55761078</a><br>I&#039;m getting tired of the isekai genre bro<br>Go write me a slice of life comedy romance /fit/ making it story instead and post it later, thanks",
      "name": "Anonymous",
      "no": 55761106,
      "now": "05/27/20(Wed)16:34:37",
      "resto": 55761078,
      "time": 1590611677
    },
    {
      "com": "<a href=\"#p55761078\" class=\"quotelink\">&gt;&gt;55761078</a>",
      "ext": ".png",
      "filename": "1589313700140",
      "fsize": 151811,
      "h": 598,
      "md5": "MB+ARQClLv2KYjeaoTauRg==",
      "name": "Anonymous",
      "no": 55761108,
      "now": "05/27/20(Wed)16:34:41",
      "resto": 55761078,
      "tim": 1590611681600,
      "time": 1590611681,
      "tn_h": 125,
      "tn_w": 85,
      "w": 410
    },
    {
      "com": "<a href=\"#p55761094\" class=\"quotelink\">&gt;&gt;55761094</a><br>“Grandma!” the boy yelled. He raised both arms in the air and waved at her.<br><br>The old lady smiled and waved back at him.<br><br>“Natty,” she said with a soft voice as she got closer, “have you finished your chores already?”<br><br>The boy smiled from ear to ear. “Of course! I work fast, you know that!”<br><br>Grandma laughed and patted Natty on his hair. “Of course, of course. My, I can’t believe you’re 13 years old already, you’re getting so big and strong.”<br><br>Natty blushed and waved her hand away. “Geez Grandma, I’m not a kid anymore! I’m getting baptized next week at the chapel and getting my [Class], and then I’ll officially be an adult!”<br><br>Grandma sighed. “I know, I just wish you would stay a kid just a little longer. Time passes so fast...”<br><br>She ruffled Natty’s hair one more time as they both went inside the hut to have lunch.<br><br>-<br><br>Days later, Natty found himself standing wearing his finest clothes in front of the village’s chapel. It was old, cut from the same rough stone that was used for the village bridge, and green moss had grown on spots where the sun rarely fell. He scratched his neck, since the woolen vest he was wearing was itching something bad. He sighed and shrugged to himself, but then heard someone call his name from behind him.<br><br>“Heeeey, Natty!”<br><br>A young girl was running towards him. She was wearing a white linen dress and leather sandals, her suntan skin clashing with the pale cloth. Her dark, frizzy hair was tied up in a short ponytail with a blue ribbon, and her blue eyes were gleaming in the midday sun.<br><br>“Glad I caught you before you went inside!” she exclaimed joyfully as she stopped in front of him.",
      "name": "Anonymous",
      "no": 55761110,
      "now": "05/27/20(Wed)16:35:07",
      "resto": 55761078,
      "time": 1590611707
    },
    {
      "com": "<a href=\"#p55761078\" class=\"quotelink\">&gt;&gt;55761078</a><br><span class=\"quote\">&gt;isekai&#039;d by a dairy truck</span><br>Milk truck just arrive :^)))))",
      "name": "Anonymous",
      "no": 55761112,
      "now": "05/27/20(Wed)16:35:16",
      "resto": 55761078,
      "time": 1590611716
    },
    {
      "com": "<a href=\"#p55761110\" class=\"quotelink\">&gt;&gt;55761110</a><br>“Hey Fayn,” Natty said with a hint of surprise in his voice, “You look… pretty. I think this is the first time I’ve seen you in a dress.”<br><br>Fayn punched his shoulder hard. Natty pretended not to feel it.<br>“Don’t say stuff like that, jackass!” Her tan was unable to hide the slight blush on her cheeks.<br><br>Natty grinned at her. “Heheh, I see you’re as easy to bait as ever. Well, let’s get inside and get this over with.”<br><br>They both fixed their clothing a last time and headed to the entrance to the chapel.<br><br>-<br><br>The inside of the chapel was nice and cool. Aside from the main hall, there was a few antechambers, and doors leading to the priest’s office and the stairs to the bell tower. The main room had a few rows of wooden benches facing the altar, and the altar itself was humble, with but a few holy relics placed upon a velvet cloth. Hanging over the altar was the Symbol of the Sun, a four-armed cross meant to represent the four elements of reality.<br><br>Sitting on the benches were the three other kids from the village who had turned 13 in the last year. Brom, the blacksmith’s son, already stout for his age. Ragna, the daughter of a local farmer, a fair but meek girl. And Lenheit, the son of a poacher, pale and ghostly from learning his father’s trade at night. The priest was standing facing the altar when Natty and Fayn entered, and turned around as he heard the door open.<br><br>“Ah, Nathaniel, Fayana, you’re here. Good. Then we can get started.”<br><br>He stroked his long, gray beard and adjusted the clerical gown on his head before picking up a decorated staff that was resting against the altar.",
      "name": "Anonymous",
      "no": 55761129,
      "now": "05/27/20(Wed)16:36:09",
      "resto": 55761078,
      "time": 1590611769
    },
    {
      "com": "<a href=\"#p55761129\" class=\"quotelink\">&gt;&gt;55761129</a><br>“So, everyone,” his calm but clear voice reverberated against the stone walls, “when I call your names, please step up here and kneel before the Sun. You will then receive your [Class], and with that, take your first step into adulthood.”<br><br>One by one, the children walked up to the altar, and returned to the benches as an adult. When they knelt before the Sun, the priest would recite an incantation and swing the staff above their heads. A golden light would shine down from the symbol, and in the light, letters would appear, letting them know what their gift would be.<br><br>[Geomancer]<br><br>[Apothecary]<br><br>[Huntsman]<br><br>Finally, Fayn was called forth. As she knelt before the symbol, hands clasped in front of her, her eyes closed, and the light fell upon her, Natty could feel his heart skip a beat.<br><br>[Brawler]<br><br>Somehow, it fit just right.<br><br>Fayn returned to her seat, flashing a smile at Natty on the way.<br><br>“Nathaniel Geinz,” the priest called.<br><br>Natty went up before the altar and knelt down. He felt the warm glow of the Sun’s light envelop him, and he clasped his hands together, closed his eyes, and prayed.<br><br>Suddenly, he felt a shift. He opened his eyes and looked around. He was no longer in the church, instead he found himself in a plane that seemed to be made of pure light, stretching far beyond what his eyes could see. From above, he could hear the faint sound of wings flapping, and as he looked up his eyes fell upon a figure descending slowly towards him.<br><br>There was something familiar about the angel that stood before him. Dark, tan, tattooed skin, spiky hair, and a smile like that of an old friend. His glorious white wings extended far out from his back, and a glowing halo surrounded his lean face.<br><br>“Sup brah, long time no see, eh? Good job on making it this far, ya absolute madlad.”",
      "name": "Anonymous",
      "no": 55761144,
      "now": "05/27/20(Wed)16:37:10",
      "resto": 55761078,
      "time": 1590611830
    },
    {
      "com": "<a href=\"#p55761144\" class=\"quotelink\">&gt;&gt;55761144</a><br>Natty realized he’d been staring with his mouth agape. He quickly lowered his head.<br><br>“Good angel, I am not worthy of you showing yourself before me.”<br><br>“Cut the bullshit pleasantries, brah, it’s gay as fuck,” the angel snapped back at him. “Listen, ya ‘ave done well, so ya gonna get a special surprise from be and Big Skydaddy. Don’t muck it up.”<br><br>“Good angel, I don’t understand...” Natty’s voice quivered.<br><br>“Dude, I said cut it. Look, things will get tough, but keep at it, brah, and you’re gonna make it. Discipline is key, man, key!” The angel took off and started ascending towards the bright light he came from.<br><br>“It will all make sense, soon, brah!”<br><br>Natty blinked. He was back in the church. Over his head were golden letters shining brightly in the light of the Sun.<br><br>[Muscle Wizard]<br><br>-<br><br>An autumn sun hung low in the horizon, covering the valley in a hazy orange glow.<br><br>“[Pump]!”<br><br>Natty’s muscles bulged, growing in size, vascularity popping up from underneath the skin. He grabbed the tree trunk with his hands and with a groan lifted it up onto his shoulders. He slowly staggered over to the nearby cart and placed the trunk on the pile of logs already on the flatbed.<br><br>“Alright, that’s the last of ‘em, lad. Excellent work today! Impressive as always.”<br><br>Natty deflated back to his normal size as the foreman tossed him a coin pouch. He’d begun working for the local lumberjacks not long ago, and made steady coin doing the work of three men, carrying tree trunks and logs back and forth between the logging sites and the road taking them to the sawmill. He waved goodbye to the men working with him at the lumber site, and started jogging back towards the village.",
      "name": "Anonymous",
      "no": 55761158,
      "now": "05/27/20(Wed)16:38:12",
      "resto": 55761078,
      "time": 1590611892
    },
    {
      "com": "<a href=\"#p55761158\" class=\"quotelink\">&gt;&gt;55761158</a><br>[Pump]<br><br>A skill unique to a [Muscle Wizard].<br><br>It increases the physical strength of the user by several magnitudes for a short period of time. Power and duration depends on the natural strength and magic capability of the user, and increasing both makes the skill that much more powerful. It’s the foundation of the physical magic that a [Muscle Wizard] specializes in.<br><br>Half a year had passed since the baptism ceremony and Natty’s angelic vision. In that time, he had begun exploring the extends of his [Class], and had come upon the discovery of the [Pump] skill during a workout session. He was lost in thought about how to extend his magical capability during his jog home, when his nostrils picked up the scent of burnt wood. Coming over a hill, he saw the flicker of a fire lighting up the trees near the hut where he lived. A column of thick smoke rose up into the violet evening sky. Dark clouds were gathering beyond the eastern mountains. He froze, eyes wide in terror. His home was on fire.<br><br>He sprinted. The sun had barely made it beyond the horizon when he reached the grounds. Broken stoneware and splintered wood were spread chaotically around, illuminated by the tall flames emanating from the remains of the ransacked hut.<br><br>“Grandma!? GRANDMA!!” Natty yelled. There was no answer.<br><br>“SkrreeeEEEEEE!!”<br><br>The screech had come from behind the hut.<br><br>He rushed back there. In the flickering light, he saw three short figures hunched over a humanoid form lying on the ground. He drew closer, and as the three figures shifted away from the form on the ground and focused their attention on him, he saw who was lying there.<br><br>It was Grandma. Bruised, bloodied, she looked as if all liquid had been sucked out of her frail body. She wasn’t breathing.<br><br>One of the figures opened its maw, revealing an oval hole lined with razor-sharp leech-like teeth. An ear-piercing shriek tore into the night. They were a group of [Drain Goblins].",
      "name": "Anonymous",
      "no": 55761172,
      "now": "05/27/20(Wed)16:39:14",
      "resto": 55761078,
      "time": 1590611954
    },
    {
      "com": "<a href=\"#p55761172\" class=\"quotelink\">&gt;&gt;55761172</a><br>Natty’s vision reddened. He didn’t even hear himself activate [Pump], and the next thing he knew, he was standing holding the upper half of a goblin skull in his hands, blood dripping onto the decapitated corpse by his feet, head torn off at the jaw. The two remaining goblins took a few steps back, then launched at him at the same time, teeth and claws extended, ready to flay him and drain his vitality from his body.<br><br>Natty launched the skull at one of the goblins with an underhand throw. It hit it square in the shoulder, disintegrating in the process, tearing the arm off the goblin and sending it spinning. The other goblin managed to close the distance, and dug its claws and teeth into the exposed back of Natty. He felt his legs give out under him as the goblin began stealing his life force. Quickly, he reached behind and grabbed the goblin by its leg, swinging it overhead and slamming it into the rocky soil, pulverizing every bone in its upper body. Regaining his composure, he walked over to the last goblin, which was pathetically trying to scurry away while clutching the wound of where its arm had used to be. Raising his leather boot above its head, Natty brought it down with ground-shaking force, splattering goblin brains across the dirt.<br><br>Natty fell to his knees, the effect of [Pump] leaving his body as the first drops of rain started to fall. He staggered his way over to his grandma. As he knelt in front of her body, an autumnal downpour began hammering the quiet valley, quickly extinguishing the fire and left the grounds covered in a dark, smoldering blanket of water and smog. Before the emergency dispatch from the village arrived on the scene, it was said that they could hear the lamenting cries of Natty from miles off, even through the heavy rain.<br><br>- - - - -<br><br>End of chapter 1. Thanks for reading my faggotry. Feedback appreciated, ideas for story arcs even more appreciated. I do have a few ideas in my head already that I&#039;m working on.",
      "name": "Anonymous",
      "no": 55761185,
      "now": "05/27/20(Wed)16:40:15",
      "resto": 55761078,
      "time": 1590612015
    },
    {
      "com": "<a href=\"#p55761106\" class=\"quotelink\">&gt;&gt;55761106</a><br><span class=\"quote\">&gt;slice of life comedy romance /fit/ making it story</span><br>Just go read mire threads.",
      "name": "Anonymous",
      "no": 55761220,
      "now": "05/27/20(Wed)16:42:55",
      "resto": 55761078,
      "time": 1590612175
    },
    {
      "com": "<a href=\"#p55761220\" class=\"quotelink\">&gt;&gt;55761220</a><br>kek",
      "name": "Anonymous",
      "no": 55761253,
      "now": "05/27/20(Wed)16:44:46",
      "resto": 55761078,
      "time": 1590612286
    },
    {
      "com": "<a href=\"#p55761220\" class=\"quotelink\">&gt;&gt;55761220</a><br>lolled",
      "ext": ".jpg",
      "filename": "christmas cake laughing at you",
      "fsize": 168387,
      "h": 1200,
      "md5": "NQQp1Nu0rrp3kg8bQHpjrw==",
      "name": "Anonymous",
      "no": 55761268,
      "now": "05/27/20(Wed)16:46:12",
      "resto": 55761078,
      "tim": 1590612372363,
      "time": 1590612372,
      "tn_h": 125,
      "tn_w": 88,
      "w": 848
    },
    {
      "com": "Good ending for chapter 1 anon, just as in the original thread I must commend you for your taste in childhood friend tomboys. I like where this is going. <br><br>Pic related, a muscle wizard from the frozen tundras of the north.",
      "ext": ".png",
      "filename": "1581954678500",
      "fsize": 1669998,
      "h": 960,
      "md5": "RJuNMXiW4lOg2YuGe6b4bQ==",
      "name": "Anonymous",
      "no": 55761277,
      "now": "05/27/20(Wed)16:46:45",
      "resto": 55761078,
      "tim": 1590612405896,
      "time": 1590612405,
      "tn_h": 93,
      "tn_w": 125,
      "w": 1280
    },
    {
      "com": "<a href=\"#p55761185\" class=\"quotelink\">&gt;&gt;55761185</a><br><span class=\"quote\">&gt;Drain Goblin</span><br>a physical description of new types of enemies would be much appreciated, it allows the reader to acknowledge the danger itself",
      "name": "Anonymous",
      "no": 55761284,
      "now": "05/27/20(Wed)16:47:22",
      "resto": 55761078,
      "time": 1590612442
    },
    {
      "com": "<a href=\"#p55761277\" class=\"quotelink\">&gt;&gt;55761277</a><br><span class=\"quote\">&gt;me rushing to help out tomboy chads</span>",
      "ext": ".jpg",
      "filename": "1589968854310",
      "fsize": 274845,
      "h": 617,
      "md5": "KDF3zOgKXZ1/vy+p7PheSQ==",
      "name": "Anonymous",
      "no": 55761299,
      "now": "05/27/20(Wed)16:48:26",
      "resto": 55761078,
      "tim": 1590612506181,
      "time": 1590612506,
      "tn_h": 112,
      "tn_w": 125,
      "w": 683
    },
    {
      "com": "<a href=\"#p55761284\" class=\"quotelink\">&gt;&gt;55761284</a><br>Good point.<br><br>The figures surrounding her were short, bony-looking humanoids with long limbs and crooked backs, wearing tattered, dirty rags for clothes. One of the figures opened its maw, revealing an oval hole lined with razor-sharp leech-like teeth. An ear-piercing shriek tore into the night. They were a group of [Drain Goblins].<br><br>Consider it revised.",
      "name": "Anonymous",
      "no": 55761329,
      "now": "05/27/20(Wed)16:50:26",
      "resto": 55761078,
      "time": 1590612626
    },
    {
      "com": "I&#039;m expecting a never ending loop of rebirth in different worlds as he repeatedly fails to get laid before 30 despite increasing intervention by zyzz.",
      "name": "Anonymous",
      "no": 55761365,
      "now": "05/27/20(Wed)16:52:46",
      "resto": 55761078,
      "time": 1590612766
    },
    {
      "com": "<a href=\"#p55761299\" class=\"quotelink\">&gt;&gt;55761299</a><br>Tomboy chads need to stick together, we&#039;re outnumbered but we&#039;re not outgunned.",
      "ext": ".gif",
      "filename": "lou coming for you",
      "fsize": 1868032,
      "h": 480,
      "md5": "PK8AkdgUHzbihSlnUbzWEQ==",
      "name": "Anonymous",
      "no": 55761381,
      "now": "05/27/20(Wed)16:53:53",
      "resto": 55761078,
      "tim": 1590612833487,
      "time": 1590612833,
      "tn_h": 93,
      "tn_w": 125,
      "w": 640
    },
    {
      "com": "<a href=\"#p55761381\" class=\"quotelink\">&gt;&gt;55761381</a><br>Reminds me I need to include a Death Cult that focuses on brainwashing young children into thinking they&#039;re the opposite gender, and then mutilates their genitals.",
      "name": "Anonymous",
      "no": 55761472,
      "now": "05/27/20(Wed)17:02:14",
      "resto": 55761078,
      "time": 1590613334
    },
    {
      "com": "<a href=\"#p55761472\" class=\"quotelink\">&gt;&gt;55761472</a><br>This guy needs to give them a quest to stop Tomboy Genocide",
      "ext": ".png",
      "filename": "tomboy genocide",
      "fsize": 596253,
      "h": 705,
      "md5": "mglrMdDLd3t3kipm4tzXXQ==",
      "name": "Anonymous",
      "no": 55761487,
      "now": "05/27/20(Wed)17:03:34",
      "resto": 55761078,
      "tim": 1590613414331,
      "time": 1590613414,
      "tn_h": 121,
      "tn_w": 125,
      "w": 724
    },
    {
      "com": "<a href=\"#p55761487\" class=\"quotelink\">&gt;&gt;55761487</a><br><span class=\"quote\">&gt;Scruffy McGruff commander of the Knight&#039;s Militia sends Natty &amp; Co. on a mission to destroy the T&#039;rann Cult that&#039;s been abducting children and brainwashing them into performing demon worship self-mutilation rituals and joining their army</span>",
      "name": "Anonymous",
      "no": 55761523,
      "now": "05/27/20(Wed)17:06:34",
      "resto": 55761078,
      "time": 1590613594
    },
    {
      "com": "<a href=\"#p55761523\" class=\"quotelink\">&gt;&gt;55761523</a><br>the boss of the camp is a massive drag queen with a jew nose who wields a hammer in one hand and a sickle in the other, 8ft tall and 550 lbs of raw medieval marxist power.",
      "name": "Anonymous",
      "no": 55761547,
      "now": "05/27/20(Wed)17:08:10",
      "resto": 55761078,
      "time": 1590613690
    },
    {
      "com": "<a href=\"#p55761547\" class=\"quotelink\">&gt;&gt;55761547</a><br><span class=\"quote\">&gt;camp</span><br>It would have to be some hidden underground temple, perhaps hidden underneath family restaurants part of a certain chain.<br><br>Hmm....",
      "name": "Anonymous",
      "no": 55761594,
      "now": "05/27/20(Wed)17:11:51",
      "resto": 55761078,
      "time": 1590613911
    },
    {
      "com": "<a href=\"#p55761078\" class=\"quotelink\">&gt;&gt;55761078</a><br>good shit bby",
      "name": "Anonymous",
      "no": 55761660,
      "now": "05/27/20(Wed)17:16:26",
      "resto": 55761078,
      "time": 1590614186
    },
    {
      "com": "<a href=\"#p55761594\" class=\"quotelink\">&gt;&gt;55761594</a><br>After dealing with the cult worshipping the dark god Tra-Nee, what other adventures could they go on? The Holy Shaker from last thread guarded by the hermit Scoobson and those who fail his tests are cast into the pit of manlets and dyels, searching for the ancient king who left humanity behind for gains and became a lich (Lich Piana), something to do with the the Swamp Tyrant of the Bloat Marshes, etc",
      "name": "Anonymous",
      "no": 55761698,
      "now": "05/27/20(Wed)17:19:32",
      "resto": 55761078,
      "time": 1590614372
    },
    {
      "com": "<a href=\"#p55761698\" class=\"quotelink\">&gt;&gt;55761698</a><br>Training, party gathering, and initial combat/skills gathering will take up the first couple of chapters, but apart from saving the tomboys being a big arc, I&#039;m open for ideas. I like Lich Piana. Gotta work that in somehow.",
      "name": "Anonymous",
      "no": 55761737,
      "now": "05/27/20(Wed)17:21:56",
      "resto": 55761078,
      "time": 1590614516
    },
    {
      "com": "<a href=\"#p55761698\" class=\"quotelink\">&gt;&gt;55761698</a><br>we need this guy implemented as some kind of sleazy merchant lord or chancellor trying to topple the realm of the natties for his own agenda",
      "ext": ".jpg",
      "filename": "1590194592672",
      "fsize": 547469,
      "h": 963,
      "md5": "pLmM2B8yqhhY8i4p45DdPA==",
      "name": "Anonymous",
      "no": 55761769,
      "now": "05/27/20(Wed)17:24:25",
      "resto": 55761078,
      "tim": 1590614665599,
      "time": 1590614665,
      "tn_h": 106,
      "tn_w": 125,
      "w": 1127
    },
    {
      "com": "<span class=\"quote\">&gt;&quot;My name is Billy, but you can call me Aniki.&quot;</span>",
      "name": "Anonymous",
      "no": 55761784,
      "now": "05/27/20(Wed)17:25:28",
      "resto": 55761078,
      "time": 1590614728
    },
    {
      "com": "honestly surprised there was no demon lord introduced yet",
      "name": "Anonymous",
      "no": 55761806,
      "now": "05/27/20(Wed)17:26:52",
      "resto": 55761078,
      "time": 1590614812
    },
    {
      "com": "<a href=\"#p55761806\" class=\"quotelink\">&gt;&gt;55761806</a><br>i guess isekai-bro is only using good parts of the isekai genre and cuts all the major weeb faggotry out and replaces it with /fit/ faggotry",
      "name": "Anonymous",
      "no": 55761824,
      "now": "05/27/20(Wed)17:28:35",
      "resto": 55761078,
      "time": 1590614915
    },
    {
      "com": "<a href=\"#p55761824\" class=\"quotelink\">&gt;&gt;55761824</a><br><span class=\"quote\">&gt;implying I&#039;m not gonna have Natty cultivate Qi for 3000 years</span>",
      "name": "Anonymous",
      "no": 55761859,
      "now": "05/27/20(Wed)17:30:20",
      "resto": 55761078,
      "time": 1590615020
    },
    {
      "com": "hey bro, I worked at a publishing house and writing is my hobby, I&#039;m not reading this right now but let me get you advice<br>Don&#039;t start with descriptions like that. Start with action. This dude can suddenly appear in this new world and later you will describe in dialogues or his thoughts or flashbacks in the night after some important entry scene how he ended there.<br><br>I&#039;ll read that later and give you more advice if you want",
      "ext": ".jpg",
      "filename": "1554509960630",
      "fsize": 105384,
      "h": 750,
      "md5": "DsVZk1RdpS1lbsC6QHQ3IA==",
      "name": "Anonymous",
      "no": 55761868,
      "now": "05/27/20(Wed)17:30:40",
      "resto": 55761078,
      "tim": 1590615040447,
      "time": 1590615040,
      "tn_h": 125,
      "tn_w": 78,
      "w": 469
    },
    {
      "com": "<a href=\"#p55761868\" class=\"quotelink\">&gt;&gt;55761868</a><br>not isekai-bro here, but i got a question for you. is it advised to make little sketches of your characters parallel to your story to further immersion effect? like pic related (not made by me)<br><br><span class=\"quote\">&gt;t. wants to make a little story about a veteran demigryph knight fending off an beastmen ambush</span>",
      "ext": ".jpg",
      "filename": "7bdeee134130b425bcb7beb15a2442c7738b5b32_hq",
      "fsize": 136201,
      "h": 768,
      "md5": "nEXyMfMTBg1KlQeI+3vF9w==",
      "name": "Anonymous",
      "no": 55761963,
      "now": "05/27/20(Wed)17:36:24",
      "resto": 55761078,
      "tim": 1590615384666,
      "time": 1590615384,
      "tn_h": 93,
      "tn_w": 125,
      "w": 1024
    },
    {
      "com": "Based.<br>10/10 would buy the ebook of",
      "name": "Anonymous",
      "no": 55762096,
      "now": "05/27/20(Wed)17:44:05",
      "resto": 55761078,
      "time": 1590615845
    },
    {
      "com": "<a href=\"#p55761784\" class=\"quotelink\">&gt;&gt;55761784</a><br>I miss him everyday. That is a good idea though, maybe Aniki and the other gachi bros could be traveling circus performers who always manage to be at the next town or city no matter the distance or time.",
      "ext": ".jpg",
      "filename": "1579537980763",
      "fsize": 71831,
      "h": 735,
      "md5": "MLb3L4W+8VMRglvVQZ3pNQ==",
      "name": "Anonymous",
      "no": 55762107,
      "now": "05/27/20(Wed)17:44:41",
      "resto": 55761078,
      "tim": 1590615881810,
      "time": 1590615881,
      "tn_h": 125,
      "tn_w": 93,
      "w": 551
    },
    {
      "com": "<a href=\"#p55761963\" class=\"quotelink\">&gt;&gt;55761963</a><br>If you like drawing you can draw your characters from imagination to get to know them even better, some people who can draw better than a handicapped girl like to make sketches of scenes in their notes or outlines<br>So yeah, you can draw your characters and scenes, but it&#039;s not necessary",
      "name": "Anonymous",
      "no": 55762129,
      "now": "05/27/20(Wed)17:45:38",
      "resto": 55761078,
      "time": 1590615938
    },
    {
      "com": "<a href=\"#p55762107\" class=\"quotelink\">&gt;&gt;55762107</a><br>He&#039;s gonna be a bard.",
      "name": "Anonymous",
      "no": 55762357,
      "now": "05/27/20(Wed)18:01:26",
      "resto": 55761078,
      "time": 1590616886
    },
    {
      "com": "<a href=\"#p55761868\" class=\"quotelink\">&gt;&gt;55761868</a><br><span class=\"quote\">&gt;if you want</span><br>Yes please.",
      "name": "Anonymous",
      "no": 55762381,
      "now": "05/27/20(Wed)18:02:29",
      "resto": 55761078,
      "time": 1590616949
    },
    {
      "ext": ".jpg",
      "filename": "a8fe005885bafe9782857c8db5113861",
      "fsize": 59434,
      "h": 469,
      "md5": "Pcnpb17tysOGgo/OWyvdgA==",
      "name": "Anonymous",
      "no": 55762784,
      "now": "05/27/20(Wed)18:31:16",
      "resto": 55761078,
      "tim": 1590618676211,
      "time": 1590618676,
      "tn_h": 90,
      "tn_w": 125,
      "w": 650
    },
    {
      "com": "<a href=\"#p55762784\" class=\"quotelink\">&gt;&gt;55762784</a><br>archangel zyzz",
      "name": "Anonymous",
      "no": 55762919,
      "now": "05/27/20(Wed)18:42:23",
      "resto": 55761078,
      "time": 1590619343
    },
    {
      "com": "Ight, fella, I may be late to this thread, but here are some of my criticisms:<br><br>1. Ditch the opening bit, it really doesn&#039;t need to be there. Any exposition can be done by Zyzz in purgatory. Ambiguity will be a very nice tool for your protagonist&#039;s past, since they are starting anew.<br><br>2. Where&#039;s the conflict??? All this chapter does is give us some backstory and some context. Either double down on the wish fulfillment, or double down on the tragedy. Our protagonist currently has no motivation and no end goal.<br><br>I suggest this: First off, age him up to 15 so he can be considered a bit more of a man, 13 is still well in &quot;child&quot; territory. Second off, set up his relationships with everyone better. Let is see them together, let us see a little bit of who they are. Then, kill them all. ALL of them. Tomboy gf, grandma, best friend, dead. Tear his idyllic world from right in front of him. Lastly, have this lead directly into Natty&#039;s motivation, where he wants either revenge or justice for whomever or whatever killed his village.<br><br>3. Characterize your protagonist better. Many isekai fall into this trap, and I see this happening to yours. Give him a discrenible personality right off the bat, by showing it off as opposed to telling the audience about it. Even something akin to Jonathan Joestar would be better.<br><br>Other than that, I like the concept. Overall a pleasant read so far.<br><br>Some character concepts:<br><br><span class=\"quote\">&gt;Big, buff Gigachad. Very handsome, always calm and smiling. Can be thick-skulled at times, has a hard time understanding subtext.</span><br><br><span class=\"quote\">&gt;Party animal, a young man drunk on local fame and hoes. Cocky, overly confident, barely takes anything seriously. Highly luck-based strategies.</span><br><br><span class=\"quote\">&gt;Young, bright-eyed, heart-of-the-group newbie who learns what it means to be a hero and ends up sacrificing himself, resulting in a soul-crushing scene.</span><br><br><span class=\"quote\">&gt;A young woman healer. Generally cheerful, optimistic, and genuinely innocent, to be contrasted heavily with the villain&#039;s main henchwoman.</span>",
      "name": "Anonymous",
      "no": 55763199,
      "now": "05/27/20(Wed)19:01:34",
      "resto": 55761078,
      "time": 1590620494
    },
    {
      "com": "<span class=\"quote\">&gt;The Oil Salesman: a cheerful, slightly mischievous being that deals in oils and cursed objects. Seems borderline omnipotent, but only ever uses its powers to mess with people. Loves following adventurers and giving them weapons of mass destruction.</span>",
      "ext": ".jpg",
      "filename": "3T_PvB6K",
      "fsize": 26423,
      "h": 400,
      "md5": "BP/FLyG3nYMzHaMmtH/xLA==",
      "name": "Anonymous",
      "no": 55763313,
      "now": "05/27/20(Wed)19:11:01",
      "resto": 55761078,
      "tim": 1590621061731,
      "time": 1590621061,
      "tn_h": 125,
      "tn_w": 125,
      "w": 400
    },
    {
      "com": "<a href=\"#p55763199\" class=\"quotelink\">&gt;&gt;55763199</a><br>Thank you for the feedback. Much appreciated.<br><br>You&#039;re not the only one to point out the opening bit. I&#039;ve been working on shortening it. Chapter 2 will serve as both a timeskip, but also cement Natty&#039;s personality, since changes will happen. Conflict will ensue with him arriving in a new environment. But I don&#039;t want to reveal too much.",
      "name": "Anonymous",
      "no": 55763317,
      "now": "05/27/20(Wed)19:11:28",
      "resto": 55761078,
      "time": 1590621088
    },
    {
      "com": "<a href=\"#p55761144\" class=\"quotelink\">&gt;&gt;55761144</a><br>Fuckin “Natty Geinz”",
      "ext": ".jpg",
      "filename": "B6DC25F9-9218-4112-B0C4-017C07B954F1",
      "fsize": 3018,
      "h": 95,
      "md5": "mVl3TqoHoSUP5mU65K26Zg==",
      "name": "Anonymous",
      "no": 55763318,
      "now": "05/27/20(Wed)19:11:29",
      "resto": 55761078,
      "tim": 1590621089425,
      "time": 1590621089,
      "tn_h": 95,
      "tn_w": 125,
      "w": 125
    },
    {
      "com": "<a href=\"#p55763199\" class=\"quotelink\">&gt;&gt;55763199</a><br><span class=\"quote\">&gt;Any exposition can be done by Zyzz in purgatory</span><br>That reminds me of the beginning of Goethe&#039;s Faust: Part 1. Would very much appreciate Zyzz hinting in an monologue/dialogue why the protagonist is reincarnated and what his purpose will be in the new isekai world. Even light foreshadowing would suffice",
      "name": "Anonymous",
      "no": 55763323,
      "now": "05/27/20(Wed)19:11:46",
      "resto": 55761078,
      "time": 1590621106
    },
    {
      "com": "You have to give natty a little more characterizing in the first part. Maybe make him autistically try and blow vapor clouds in the cold air or get scared when a woman tries talk to him. Introduce fayn earlier so it&#039;s not such an infodump and stretch chapter one a bite more. There&#039;s nothing about this part that makes me curious so try and add in some curiousity hooks",
      "name": "Anonymous",
      "no": 55763357,
      "now": "05/27/20(Wed)19:14:21",
      "resto": 55761078,
      "time": 1590621261
    },
    {
      "com": "<a href=\"#p55761185\" class=\"quotelink\">&gt;&gt;55761185</a><br>Didn’t even have zyzz say “were all gonna make it brah” 0/10",
      "name": "Anonymous",
      "no": 55763426,
      "now": "05/27/20(Wed)19:20:51",
      "resto": 55761078,
      "time": 1590621651
    },
    {
      "com": "<a href=\"#p55761329\" class=\"quotelink\">&gt;&gt;55761329</a><br>Maybe call it an open maw? “Hole” sounds a little out of place",
      "name": "Anonymous",
      "no": 55763440,
      "now": "05/27/20(Wed)19:22:07",
      "resto": 55761078,
      "time": 1590621727
    },
    {
      "com": "<a href=\"#p55763357\" class=\"quotelink\">&gt;&gt;55763357</a><br>i agree you have to establish the main character more or else you will fall into the generic mc isekai trope. You can kinda skip the fleshing out some supporting characters if they only serve a short roll in the overall arc of things. Granted they should still have unique and interesting concepts behind them.",
      "name": "Anonymous",
      "no": 55763446,
      "now": "05/27/20(Wed)19:22:33",
      "resto": 55761078,
      "time": 1590621753
    },
    {
      "com": "<a href=\"#p55763317\" class=\"quotelink\">&gt;&gt;55763317</a><br>what does the overall world look like? Medieval magic with steam engine tech already implemented or are we strictly speaking of pure fantasy?",
      "name": "Anonymous",
      "no": 55763507,
      "now": "05/27/20(Wed)19:27:34",
      "resto": 55761078,
      "time": 1590622054
    },
    {
      "com": "Chapter 2 sneak peek.<br><br><a href=\"#p55763507\" class=\"quotelink\">&gt;&gt;55763507</a><br>15th century-level medieval world with a fuckton of magic. Perhaps with some magitech through artificers.",
      "ext": ".jpg",
      "filename": "preview",
      "fsize": 524673,
      "h": 644,
      "md5": "hLJ23cQ5Ahbj/MbcaH42bg==",
      "name": "Anonymous",
      "no": 55763582,
      "now": "05/27/20(Wed)19:34:29",
      "resto": 55761078,
      "tim": 1590622469622,
      "time": 1590622469,
      "tn_h": 120,
      "tn_w": 124,
      "w": 667
    },
    {
      "com": "Cackling at the thought of the inevitable youtube video about this thread.<br><br>Don&#039;t include me in the screenshot.",
      "name": "Anonymous",
      "no": 55763747,
      "now": "05/27/20(Wed)19:49:47",
      "resto": 55761078,
      "time": 1590623387
    },
    {
      "com": "<a href=\"#p55763747\" class=\"quotelink\">&gt;&gt;55763747</a><br>Too late bitchboy we&#039;re all in the screencap<br><br><a href=\"#p55763199\" class=\"quotelink\">&gt;&gt;55763199</a><br>leave a man&#039;s tomboy gf alone, it might be better if his first call to action is everyone but his girl getting killed and he has to go rescue her from an evil cult (like the tranny cult)",
      "name": "Anonymous",
      "no": 55763931,
      "now": "05/27/20(Wed)20:06:25",
      "resto": 55761078,
      "time": 1590624385
    },
    {
      "com": "<a href=\"#p55763931\" class=\"quotelink\">&gt;&gt;55763931</a><br>This, pls don&#039;t kill tomboy gf",
      "name": "Anonymous",
      "no": 55763963,
      "now": "05/27/20(Wed)20:09:35",
      "resto": 55761078,
      "time": 1590624575
    },
    {
      "com": "<a href=\"#p55763931\" class=\"quotelink\">&gt;&gt;55763931</a><br>i see now that valiant defenders of tomboys rally ITT from now on",
      "ext": ".gif",
      "filename": "1590085758870",
      "fsize": 3803602,
      "h": 403,
      "md5": "jZp68XDgO8l4gLLsNQXH0A==",
      "name": "Anonymous",
      "no": 55763973,
      "now": "05/27/20(Wed)20:10:23",
      "resto": 55761078,
      "tim": 1590624623082,
      "time": 1590624623,
      "tn_h": 125,
      "tn_w": 100,
      "w": 323
    },
    {
      "com": "<a href=\"#p55763973\" class=\"quotelink\">&gt;&gt;55763973</a><br>I have been blowing the horn of tomboys since the original thread. Gondor calls for aid, will Rohan answer?",
      "ext": ".jpg",
      "filename": "boromir death",
      "fsize": 155187,
      "h": 800,
      "md5": "hNAWbqbtkLr4S/9Ot8d6BQ==",
      "name": "Anonymous",
      "no": 55764061,
      "now": "05/27/20(Wed)20:16:41",
      "resto": 55761078,
      "tim": 1590625001024,
      "time": 1590625001,
      "tn_h": 52,
      "tn_w": 125,
      "w": 1920
    },
    {
      "com": "Gay thread",
      "name": "Anonymous",
      "no": 55764088,
      "now": "05/27/20(Wed)20:18:49",
      "resto": 55761078,
      "time": 1590625129
    },
    {
      "com": "<a href=\"#p55764088\" class=\"quotelink\">&gt;&gt;55764088</a><br>faggot",
      "name": "Anonymous",
      "no": 55764097,
      "now": "05/27/20(Wed)20:19:30",
      "resto": 55761078,
      "time": 1590625170
    },
    {
      "com": "<a href=\"#p55764088\" class=\"quotelink\">&gt;&gt;55764088</a>",
      "ext": ".jpg",
      "filename": "retard",
      "fsize": 88815,
      "h": 877,
      "md5": "UxwtmT4mMrMHLjOLstZiUw==",
      "name": "Anonymous",
      "no": 55764100,
      "now": "05/27/20(Wed)20:19:40",
      "resto": 55761078,
      "tim": 1590625180461,
      "time": 1590625180,
      "tn_h": 109,
      "tn_w": 125,
      "w": 1000
    },
    {
      "com": "<a href=\"#p55764061\" class=\"quotelink\">&gt;&gt;55764061</a><br>and rohan will answer",
      "ext": ".jpg",
      "filename": "rohancharge",
      "fsize": 503836,
      "h": 500,
      "md5": "+kKiknxvMeViISxS3zSE3w==",
      "name": "Anonymous",
      "no": 55764119,
      "now": "05/27/20(Wed)20:21:08",
      "resto": 55761078,
      "tim": 1590625268729,
      "time": 1590625268,
      "tn_h": 52,
      "tn_w": 125,
      "w": 1200
    },
    {
      "com": "Does /fit/ like cat girls?",
      "name": "Anonymous",
      "no": 55764492,
      "now": "05/27/20(Wed)20:48:56",
      "resto": 55761078,
      "time": 1590626936
    },
    {
      "com": "<a href=\"#p55764492\" class=\"quotelink\">&gt;&gt;55764492</a><br>Is that a rhetorical question?",
      "name": "Anonymous",
      "no": 55764770,
      "now": "05/27/20(Wed)21:13:13",
      "resto": 55761078,
      "time": 1590628393
    },
    {
      "com": "<a href=\"#p55764492\" class=\"quotelink\">&gt;&gt;55764492</a><br><a href=\"#p55764770\" class=\"quotelink\">&gt;&gt;55764770</a><br>I&#039;d bet more /fit/izens like monster girls than regular catgirls",
      "name": "Anonymous",
      "no": 55765141,
      "now": "05/27/20(Wed)21:46:03",
      "resto": 55761078,
      "time": 1590630363
    },
    {
      "com": "Fuck it, I&#039;m just gonna dump what I&#039;ve written so far of chapter 2.<br><br>Chapter 2: Meeting<br><br>The guards standing at both sides of the southern gate leading into Ringstad were busy passing their shift kicking a stone back and forth between them. The south gate saw the least traffic of the three gates into the city, being closest to the coast and furthest from the main street, so usually only the old or the slow were sent to stand guard there.<br><br>One of the guards noticed a person approaching out of the corner of his eye, and looked up from the game he had entertained himself with. He flinched, rubbing his eyes before doing a double take. Coming up the seaside road was a man the size of an oxen, draped in a leather cloak covering his body from head to feet. His large beard was obscuring most of face, but clear, strong eyes were gazing sternly out from underneath his hood. He was holding a large, crude satchel along his body, almost dragging it along the dirt road.<br><br>“Halt! Who goes there?” the guardsman called out, instinctively moving his hand to the hilt of his sword. The large man did not break his stride, but instead raised a hand from the inside of his cloak. His bare, muscled arm was the size of a cart axle, and covered in scars.<br><br>“A traveler, looking for passage into the city, good guardsman,” a deep, monotonous voice answered. His beard shifted, indicating a slight smile, but his eyes remained steely. The guardsman eased up a bit.<br><br>“We will have to see some proof of identity. Do you have that on you?”<br><br>“...I do not,” the man said, pausing for a bit before continuing, “I have lost most of my belongings.”",
      "name": "Anonymous",
      "no": 55765496,
      "now": "05/27/20(Wed)22:21:32",
      "resto": 55761078,
      "time": 1590632492
    },
    {
      "com": "<a href=\"#p55765496\" class=\"quotelink\">&gt;&gt;55765496</a><br>“Mugged, were you? Hard to believe bandits would dare mess with a lad of your size. Well, we can issue a temporary entry permit, but it will cost 500 ren. You can pay now, or leave something in deposit at the gatehouse until you’ve sold your wares in the city. We will also need your name, age, and place of birth.”<br><br>The large man reached into his satchel and took something out. He approached the guardsman, towering a good head and a half over him, and dropped something into his hands. The guardsman looked down upon a large, red, uncut gemstone.<br><br>“My name is Nathaniel Geinz. I am 18 years of age, and I am not sure where I was born.”<br><br>-<br><br>The narrow streets of Ringstad were a sea of colorful awnings, storefronts, and stalls. Scores of people from all races were going about their business, buying, selling, traversing, or simply relaxing. Natty was towering above them, gazing down the street, trying to eye out a good place to sell the goods he’d brought with him. He pulled back his hood, revealing a mane of thick, brown hair, tied back with a coarse thread. He felt eyes fall upon him from the shadows of the alleyways leading away from the street, but pushed their presence to the back of his mind. He hid his satchel under his cloak and started walking.<br><br>One set of eyes followed him more closely than the others. Natty felt someone slip up behind him, and tensed up as a muscular arm slipped over his shoulder.",
      "name": "Anonymous",
      "no": 55765503,
      "now": "05/27/20(Wed)22:22:34",
      "resto": 55761078,
      "time": 1590632554
    },
    {
      "com": "<a href=\"#p55765503\" class=\"quotelink\">&gt;&gt;55765503</a><br>“Yo, lil’ bro. You look lost. First time here?”<br><br>Natty look over on the guy who had so brazenly approached him. He was met with the cocky smile of an older man, scruffy stubble clinging to a cut jawline, with a short, slicked-back haircut complimenting his head. He was wearing a nice linen shirt with a v-cut, tight hoses, and leather shoes. His friendly eyes stared right in to the doubtful glare of Natty.<br><br>“What do you want?” Natty prodded at him.<br><br>“I just thought you could use a guide. You know, to show you the ropes of this town. You wouldn’t want to get taken for a ride by scrupulous types, now would you?” The man looked back over his shoulder and scanned the crowd, as to confirm that they weren’t being followed.<br><br>“In my optics, that’s exactly the kind of type you seem to be.” Natty shot back. He gave the man a look up and down, and confirmed that he was indeed rather well built. “But I suppose you could be helpful. What’s your name?”<br><br>The man flashed a confident grin.<br><br>“My name’s Billy, but my friends call me Aniki.”<br><br>“Well Aniki,” Natty said, “you can call me Natty. I don’t suppose you know of an honest pawn shop nearby?”<br><br>Before Aniki could answer, a yell rung out from behind them.<br><br>“Stop!! Thief!!”<br><br>They both turned their heads to see a fuzzy blur bolt right towards them. As it passed by, Natty’s free hand shot out from underneath the cloak and grabbed hold of its tail. The young girl was abruptly yanked onto the ground by her own momentum, the satchel of loot she was carrying flying from her grasp.",
      "name": "Anonymous",
      "no": 55765518,
      "now": "05/27/20(Wed)22:23:35",
      "resto": 55761078,
      "time": 1590632615
    },
    {
      "com": "<a href=\"#p55765518\" class=\"quotelink\">&gt;&gt;55765518</a><br>“OWWWW!! WHAT THE HELL DO NYA THINK NYA’RE DOING!?” she yelled at Natty, furiously trying to regain her tail from his hold. Natty just stared coldly at her. She was wearing raggy set of canvas clothes, her bare paws dirty from the street grime.<br><br>“Nya don’t just grab a young maiden’s tail like that, nya jackass!” she spitted, her cat ears standing up in the air. Aniki, in the meantime, had picked up the bag of loot, and walked over to her.<br><br>“Listen here, little baby,” he said, squatting down to meet her eyes, “you’re gonna get hurt if you keep living a dishonest life like that. You should turn a new leaf, you’re still young, and seeing a beauty such as yours rotting up in a jail cell would be a damn shame.” He flashed a smile at her and winked.<br><br>The girl’s furry cheeks turned bright red. Gaze turned towards the ground, she finally reclaimed her tail from Natty’s hand, and dashed off into a back alley.<br><br>“What was that just now?” Natty asked him.<br><br>“Just a bit of the ol’ [Bard] charm.” Aniki said, shooting a wink to Natty. Natty shuddered.<br><br>A stout, middle-aged man in fine, embroidered clothes ran up to them. He spent a dozen seconds catching his breath before looking up at them both, his large mustache swaying in the wind.<br><br>“Praise the Sun, you caught the thief and reclaimed my wares! But why did you let the rascal go again!?” he huffed at them. Aniki shrugged.<br><br>“That kitten learned her lesson. She won’t be stealing no more.” He smiled at the merchant and handed over the satchel to him.<br><br>“Well… Okay, if you say so. I my name is Fred Gildroy, please, follow me to my store, I must return the favor!”",
      "name": "Anonymous",
      "no": 55765531,
      "now": "05/27/20(Wed)22:24:36",
      "resto": 55761078,
      "time": 1590632676
    },
    {
      "com": "<a href=\"#p55765531\" class=\"quotelink\">&gt;&gt;55765531</a><br>Gildroy’s shop turned out to be an old, renowned establishment that specialized in buying and selling antiques and unica, but also dabbled in other valuable goods. He carefully evaluated the gemstones that Natty brought, and gave him a fair price. On their way out of the store, Natty turned to Gildroy.<br><br>“Mr. Gildroy, you seem to be a knowledgeable fellow. Have you ever seen a thing like this before?”<br><br>Natty reached into his cloak and took out a large medallion hanging from a leather string around his neck. It was a large, polished metal disc, cast from black iron, with a wide hole in the middle of it. It had a large groove running inside it, and inside that was inscribed “1.25kg”.<br><br>Gildroy looked at it curiously, studying it closely like a piece of rare art.<br><br>“Can’t say I have,” he concluded after a while, “but if you will let me make a sketch of it, I will ask around among my fellow antiquarians. Ringstad is a big and well-connected city, someone should know something.”<br><br>“Please do.” Natty said, lowering his head in a nod. Gildroy fetched parchment and a piece of charcoal from a desk drawer and made a couple of quick sketches of the medallion before returning the items to the table.<br><br>“Check back with me in a couple of days, I’ll have some answers by then.” He said. Natty thanked him, and with that, him and Aniki set out to find a tavern. The sun had sunk over the city, the last streaks of light hitting the rooftops.<br><br>- - - - -<br><br>And that&#039;s it so far. I write slowly, as I try to make things coherent the first time around.",
      "name": "Anonymous",
      "no": 55765544,
      "now": "05/27/20(Wed)22:25:38",
      "resto": 55761078,
      "time": 1590632738
    },
    {
      "com": "ANIKIIII",
      "name": "Anonymous",
      "no": 55765743,
      "now": "05/27/20(Wed)22:46:45",
      "resto": 55761078,
      "time": 1590634005
    },
    {
      "com": "<a href=\"#p55765496\" class=\"quotelink\">&gt;&gt;55765496</a><br><a href=\"#p55765503\" class=\"quotelink\">&gt;&gt;55765503</a><br>Getting major Kenshiro vibes",
      "name": "Anonymous",
      "no": 55765868,
      "now": "05/27/20(Wed)23:04:14",
      "resto": 55761078,
      "time": 1590635054
    },
    {
      "com": "<a href=\"#p55765868\" class=\"quotelink\">&gt;&gt;55765868</a><br>This is how I see him in my head.",
      "ext": ".jpg",
      "filename": "blatantly stolen",
      "fsize": 137046,
      "h": 274,
      "md5": "2BVG+oP+xhRPuDpIsP/nYw==",
      "name": "Anonymous",
      "no": 55765899,
      "now": "05/27/20(Wed)23:07:38",
      "resto": 55761078,
      "tim": 1590635258184,
      "time": 1590635258,
      "tn_h": 39,
      "tn_w": 125,
      "w": 869
    },
    {
      "com": "<a href=\"#p55764088\" class=\"quotelink\">&gt;&gt;55764088</a><br>Then leave faggot. Op is having some fun and putting actual work into a thread. Best thread in a while, way better than all the coomer and gym still closed threads. Keep at it Op I really really love this",
      "name": "Anonymous",
      "no": 55766018,
      "now": "05/27/20(Wed)23:22:44",
      "resto": 55761078,
      "time": 1590636164
    },
    {
      "com": "Fuck, re-reading this, I spot so many typos. Gonna have to fix it all before putting it on ArchiveOfOurOwn.",
      "name": "Anonymous",
      "no": 55766051,
      "now": "05/27/20(Wed)23:26:45",
      "resto": 55761078,
      "time": 1590636405
    },
    {
      "com": "<a href=\"#p55766051\" class=\"quotelink\">&gt;&gt;55766051</a><br>Chapter 2 is good so far anon, I&#039;m hitting the hay for tonight but I&#039;m looking forward to your continued writings. As a hobbyist writer myself I do recommend taking into account what <a href=\"#p55763199\" class=\"quotelink\">&gt;&gt;55763199</a>, <a href=\"#p55761868\" class=\"quotelink\">&gt;&gt;55761868</a>, <a href=\"#p55763357\" class=\"quotelink\">&gt;&gt;55763357</a> have said. Still love it though.",
      "ext": ".jpg",
      "filename": "1582296418742",
      "fsize": 48357,
      "h": 400,
      "md5": "loSVd2SS1ekVYv9UdUeF9A==",
      "name": "Anonymous",
      "no": 55766131,
      "now": "05/27/20(Wed)23:38:47",
      "resto": 55761078,
      "tim": 1590637127479,
      "time": 1590637127,
      "tn_h": 95,
      "tn_w": 125,
      "w": 526
    },
    {
      "com": "I&#039;d appreciate if fit references weren&#039;t so overt. You&#039;ve laid a good foundation for fit refs, but putting them in so blatantly pulls me back out of the story and onto 4chins. <br><br><span class=\"quote\">&gt;&quot;Natty&quot; </span><br>Would have been better if he was normally called Nate/Nathan/Nathaniel for a bit at first, but then only one person happens to call him Natty. It leaves it as an inside joke for /fit, but doesn&#039;t keep pushing it in our faces. Like either its Grandma&#039;s special name for him, or its Fayns mocking/playful nickname for him. But starting the story with him named Nate/Nathan/Nathaniel instead of Natty helps to build the story into a story instead of just a bunch of /fit refs. <br><br><span class=\"quote\">&gt;&quot;Geinz&quot; </span><br>same thing. Its just too obviously a /fit ref. Even something like obscuring the word a bit more would have helped, like &quot;Gheinz&quot; or &quot;Gaynes&quot;. By obscuring the original /fit ref a bit more, it makes it into more of an actual story. <br><br><span class=\"quote\">&gt;&quot;Muscle Wizard&quot;</span><br>Too modern a dialect. When compared against Geomancer/Apothecary/Huntsman, which are all old-timey or swords&amp;sorcery sounding words, &quot;Muscle Wizard&quot; just sounds out of place. Like you&#039;re just trying to shoe-horn it in. I&#039;m sure there&#039;s a more swords&amp;sorcery version of &quot;muscle wizard&quot;. (pls not &quot;mass bender&quot;) Something like &quot;myo conjurer&quot; or &quot;myoccultist&quot;<br><br><span class=\"quote\">&gt;[Pump] exposition at the beginning of &gt;55761172</span><br>This should have been worked into the actual story a bit better, instead of just laying it out. Laying it out like that takes us back out of the story into explanation-time. <br>Also, too obvious/fit of a word. Not swords&amp;sorcery enough. Maybe something like &quot;surge&quot; or even &quot;swell&quot;. Pump is just too on-the-nose.<br><br><span class=\"quote\">&gt;Drain Goblins</span><br>Bordering on too close to the actual reference. Even calling them Drainer Goblins might help remove it just enough, but that might be too far though. Tough call on that one. <br><br>Overall: pretty good actually, but needs to have the fit refs be more oblique and less obvious, to decrease the faggotry.",
      "name": "Anonymous",
      "no": 55766245,
      "now": "05/27/20(Wed)23:59:07",
      "resto": 55761078,
      "time": 1590638347
    },
    {
      "com": "<a href=\"#p55766245\" class=\"quotelink\">&gt;&gt;55766245</a><br>Sorry bro, but the memes are staying.",
      "name": "Anonymous",
      "no": 55766330,
      "now": "05/28/20(Thu)00:10:37",
      "resto": 55761078,
      "time": 1590639037
    },
    {
      "ext": ".gif",
      "filename": "when you see a (you) in the thread",
      "fsize": 3819678,
      "h": 360,
      "md5": "UBBpKLOW9W46MIGCsu0lIg==",
      "name": "Anonymous",
      "no": 55766682,
      "now": "05/28/20(Thu)01:02:19",
      "resto": 55761078,
      "tim": 1590642139622,
      "time": 1590642139,
      "tn_h": 93,
      "tn_w": 125,
      "w": 480
    },
    {
      "com": "<a href=\"#p55766682\" class=\"quotelink\">&gt;&gt;55766682</a><br>sleep tite aniki",
      "name": "Anonymous",
      "no": 55766829,
      "now": "05/28/20(Thu)01:26:05",
      "resto": 55761078,
      "time": 1590643565
    },
    {
      "com": "Alright, I&#039;m gonna dump what I have so far before heading to bed. Hopefully the thread will be up still when I wake up.<br><br>- - - - -<br><br>“I know of an excellent place,” Aniki suggested, “My buddy runs it. He cooks a mean croc steak.”<br><br>“Sounds good to me,” Natty replied, “I haven’t have a civilized meal in years.”<br><br>“Oh? You gotta elaborate on that. Here, follow me, we can take a shortcut through the back streets.”<br>Natty followed Aniki through the narrow back alleys of Ringstad. Aniki was making pleasant small-talk, but Natty couldn’t shake the feeling that they were being followed. Stepping around a corner, they were suddenly confronted by two hooded figures who had been standing in wait for them.<br><br>Aniki stopped dead in his tracks and stared at them. Natty flinched and turned around, only to see two more hooded figures close off the way they came from. They were trapped.<br><br>“Who are you?” Aniki asked them, confused.<br><br>One of the figures raised its arm, the sleeve of it’s long, black cloak slipping back, revealing a pale, bony hand. It pointed a finger at Natty.<br><br>“Hoister,” a ghastly, ethereal voice rang out, “give us the Plate around your neck.”<br><br>Natty unconsciously reached for his medallion.<br><br>“No way, fag,” Natty shouted at the hooded figure, “What do you want with it, anyway?”<br><br>The hooded figure clenched its hand.<br><br>“Our Master demands it. If you do not hand it over willingly, we will take it by force.”<br><br>The three other figures reached into their cloaks and pulled out a long, curved dagger each. The one pointing at Natty raised its head enough that its face was exposed. Thin, blueish skin clung onto a hairless skull, its eyes shining with a cold, icy glare.<br><br>“Uh, Natty, bro,” Aniki started, his voice uncertain, “you might want to rethink your position.”",
      "name": "Anonymous",
      "no": 55766977,
      "now": "05/28/20(Thu)01:49:43",
      "resto": 55761078,
      "time": 1590644983
    },
    {
      "com": "<a href=\"#p55766977\" class=\"quotelink\">&gt;&gt;55766977</a><br>“No time to think. Back me up!” Natty yelled, releasing the buckle on his cloak. It dropped to the ground, revealing a massive, chiseled body, covered in scars, with a huge set of claw marks running across his back. Apart from a fur loincloth, the only thing he was wearing was a pair of cord sandals, extending all the way up his ankle. In one swift motion, he squatted down as deep as he could, clenching both of his fists and locking them in for a double punch.<br><br>“[Hip Drive]!”<br><br>In a split-second burst of explosiveness, Natty launched himself ahead and smashed both of the hooded figures who’d cut off their back right in their abdomens. They flew a couple of paces back before slamming against the outer wall of a house, collapsing onto the ground. <br><br>The figure that had been speaking let out a coarse hiss and pulled out its own dagger, as the remaining both launched themselves at Aniki.<br><br>“Aniki, run!” Natty yelled, rushing back towards his original position.<br><br>“Ffffuck off, you creepy freaks!” Aniki yelled as he high-tailed it in the opposite direction of Natty. “Natty, do your best, beat those assholes into next week!”<br><br>Natty felt a rush come over him. The words from Aniki seemed to lift his spirit to a new level. Invigorated, he caught the dagger of one of the figures with his left hand, and smashed its face into a wall with his right hand. The figure fell to the ground, immobile.<br><br>Directing his attention towards the last one, he discovered that he was already face-to-face with it. Natty looked down to see the dagger half-way into his stomach. The figure let out a raspy laugh from its toothless mouth.<br><br>“You should’ve handed over the Plate while you had the chance, Hoister. Your muscles are no match for steel.” the figure said lowly.<br><br>“Oh yeah?” Natty said, smugly, “Think again, asshole. [Pump]!”",
      "name": "Anonymous",
      "no": 55766984,
      "now": "05/28/20(Thu)01:50:46",
      "resto": 55761078,
      "time": 1590645046
    },
    {
      "com": "<a href=\"#p55766984\" class=\"quotelink\">&gt;&gt;55766984</a><br>Natty’s musculature expanded to double size in a second, eclipsing the entire alleyway. His obliques twitched, and shot the dagger straight back at the figure with incredibly power, lodging it right into its chest. The figure fell to the ground.<br><br>Natty quickly returned to his normal size, and grabbed the figure by its throat.<br><br>“You motherfucker, who sent you!?” Natty demanded.<br><br>The figure laughed, coughing up gray ooze in the process.<br><br>“You’re too late, Hoister. He Who Has Left Humanity Behind is already aware of your existence. He cannot be stopped. Your struggle will be in vain, there will only be more of us coming for you until He gets his hands on the Plate. Expect us...”<br><br>With those words, the figure evaporated away into a white mist, leaving only a pile of bones inside a black cloak. Natty raised himself back up and stared at the remnants. Aniki walked up to him.<br><br>“What the fuck was that about?” he asked, staring wide-eyed at Natty.<br><br>“I guess I owe you an explanation.” Natty replied, still looking at the pile on the ground. He suddenly grimaced in pain, clutching the now fast bleeding wound on his stomach.<br><br>“Oh man, we need to get you to a healer, fast!” Aniki exclaimed in shock, grabbing Natty by the shoulder. Natty raised a hand in objection.<br><br>“I’m alright. I just need to eat. Help me get to that inn.” Natty said, picking up his cloak and draping himself in it again.<br><br>Aniki stared at him in disbelief.<br><br>“If you say so, you crazy bastard.” And with that, they hobbled towards the direction they were heading before.<br><br>- - - - -<br><br>G&#039;night /fit/.",
      "name": "Anonymous",
      "no": 55766987,
      "now": "05/28/20(Thu)01:51:48",
      "resto": 55761078,
      "time": 1590645108
    },
    {
      "com": "<a href=\"#p55766987\" class=\"quotelink\">&gt;&gt;55766987</a><br>Night OP.<br>Thanks for this.",
      "name": "Anonymous",
      "no": 55767102,
      "now": "05/28/20(Thu)02:11:03",
      "resto": 55761078,
      "time": 1590646263
    },
    {
      "com": "<a href=\"#p55761158\" class=\"quotelink\">&gt;&gt;55761158</a><br><span class=\"quote\">&gt;Muscle Wizard</span><br>Missed opportunity to let him be a musclemancer",
      "name": "Anonymous",
      "no": 55767178,
      "now": "05/28/20(Thu)02:23:28",
      "resto": 55761078,
      "time": 1590647008
    },
    {
      "com": "How To Pick Up Weights In A Dungeon is lit so far.",
      "name": "Anonymous",
      "no": 55767192,
      "now": "05/28/20(Thu)02:25:30",
      "resto": 55761078,
      "time": 1590647130
    },
    {
      "com": "What the fuck is this lol",
      "name": "Anonymous",
      "no": 55767269,
      "now": "05/28/20(Thu)02:40:07",
      "resto": 55761078,
      "time": 1590648007
    },
    {
      "com": "When&#039;s the anime releasing?",
      "name": "Anonymous",
      "no": 55767477,
      "now": "05/28/20(Thu)03:16:03",
      "resto": 55761078,
      "time": 1590650163
    },
    {
      "com": "Incredibly based and also very funny.",
      "ext": ".jpg",
      "filename": "hair2",
      "fsize": 59830,
      "h": 900,
      "md5": "DJjBzkT7G7jqCVuuYA9LUw==",
      "name": "Dugan Goether",
      "no": 55767489,
      "now": "05/28/20(Thu)03:17:30",
      "resto": 55761078,
      "tim": 1590650250394,
      "time": 1590650250,
      "tn_h": 125,
      "tn_w": 100,
      "w": 720
    },
    {
      "com": "<a href=\"#p55766245\" class=\"quotelink\">&gt;&gt;55766245</a><br><a href=\"#p55766330\" class=\"quotelink\">&gt;&gt;55766330</a><br>The memes and modern language are exactly what makes it so good. A [Muscle Wizard] is so absurdly out of place, that makes it funnier to read, and I imagine some kind of cool video game voice queued in that says these words.",
      "name": "Anonymous",
      "no": 55768063,
      "now": "05/28/20(Thu)04:50:32",
      "resto": 55761078,
      "time": 1590655832
    },
    {
      "com": "Perhaps we should move on to a new thread soon, I never know when this one&#039;ll shut down. I&#039;ll be sure do document it with screenshots.",
      "name": "Anonymous",
      "no": 55768290,
      "now": "05/28/20(Thu)05:20:37",
      "resto": 55761078,
      "time": 1590657637
    },
    {
      "com": "<a href=\"#p55764492\" class=\"quotelink\">&gt;&gt;55764492</a><br><a href=\"#p55765141\" class=\"quotelink\">&gt;&gt;55765141</a><br>Can confirm i coom to monmusu eroge every other day.<br><br>OP i would have MC meet an opponent stronger than him, so that he&#039;s forced to train, and have him power-up through some meme exercise like skateboard squats or facepulls",
      "name": "Anonymous",
      "no": 55769014,
      "now": "05/28/20(Thu)07:08:41",
      "resto": 55761078,
      "time": 1590664121
    },
    {
      "com": "came from the other thread, fucking based as all hell OP",
      "name": "Anonymous",
      "no": 55769175,
      "now": "05/28/20(Thu)07:30:43",
      "resto": 55761078,
      "time": 1590665443
    },
    {
      "com": "bump",
      "name": "Anonymous",
      "no": 55769804,
      "now": "05/28/20(Thu)08:41:24",
      "resto": 55761078,
      "time": 1590669684
    },
    {
      "com": "I&#039;m here to give yet more criticizm and suggest yet even more rewrites. Not because I&#039;m sadistic or mean, but because I want this story to be as good as it can get. Here are some issues I have:<br><br>1. Natty, as of his introduction in chapter 2, is way too buff, way too soon. We have only ever seen him kill insignificant mooks, and his pump ability needs a downside. I propose this:<br><br><span class=\"quote\">&gt;Make what you just made be chapter 3 be chapter 3 or 4</span><br><span class=\"quote\">&gt;Make chapter 2 (and possibly 3) be about him surviving in the woods or sth similar, and getting his ass beaten into the ground</span><br><span class=\"quote\">&gt;Have some mentor figure teach him how to fend for himself</span><br><span class=\"quote\">&gt;End the chapter with him performing a brutal fatality on something like a bear or a yeti</span><br><br>Then , write a short paragraph detailing the guard&#039;s duty, before adding more or less what you wrote.<br><br>2. As for [pump], it needs a drawback of some kind. I suggest that it increases muscle size by something like 1.2x or 1.5x to remain anatomically reasonable (2x or 2.5x should be proper for a villain, though), and that it works by forcing his body to exert his muscles to their maximum capacity. In this state, he can easily break bones and cause himself organ damage (due to sheer muscle swelling and overexertion), and, as of now, make pump only usable for a couple of seconds.<br><br>And I realize that you&#039;re trying to set up a mystery as for what Nat&#039;s up to, but honestly, it falls flat because the reader has literally nothing to go on.<br><br>As for villains, I suggest theming the major ones after the 7 deadly sins (lust, gluttony, greed, sloth, wrath, envy, pride), with each one putting an aspect of Nat&#039;s personality to the test. I suggest the first one be Lust, and perhaps could be related to that one catgirl you introduced in some manner.<br><br>But, as I said, move this chapter forward a bit, and give us something perhaps directly after his grandmother&#039;s (or village&#039;s) death. That&#039;s a good reason to age him up to 15 from the very beginning.",
      "name": "Anonymous",
      "no": 55770146,
      "now": "05/28/20(Thu)09:14:41",
      "resto": 55761078,
      "time": 1590671681
    },
    {
      "com": "<a href=\"#p55770146\" class=\"quotelink\">&gt;&gt;55770146</a><br><span class=\"quote\">&gt;wants this to be good</span><br><span class=\"quote\">&gt;wants it to be about trite, overdone Bible-esque tropes</span><br>Pick one, and only one.",
      "name": "Anonymous",
      "no": 55770513,
      "now": "05/28/20(Thu)09:53:04",
      "resto": 55761078,
      "time": 1590673984
    },
    {
      "com": "Hey shut up, the Bible is damn timeless. Amazing source of literary inspiration.",
      "name": "Anonymous",
      "no": 55770798,
      "now": "05/28/20(Thu)10:21:59",
      "resto": 55761078,
      "time": 1590675719
    }
  ]
}